betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Include/apm32f4xx_ddl_system.h
/**
  *
  * @file    apm32f4xx_ddl_system.h
  * @brief   Header file of SYSTEM DDL module.
  *
  * @attention
  *
  * Redistribution and use in source and binary forms, with or without modification,
  * are permitted provided that the following conditions are met:
  *
  * 1. Redistributions of source code must retain the above copyright notice,
  *    this list of conditions and the following disclaimer.
  * 2. Redistributions in binary form must reproduce the above copyright notice,
  *    this list of conditions and the following disclaimer in the documentation
  *    and/or other materials provided with the distribution.
  * 3. Neither the name of the copyright holder nor the names of its contributors
  *    may be used to endorse or promote products derived from this software without
  *    specific prior written permission.
  *
  * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" AND
  * ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
  * WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
  * IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT,
  * INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING,
  * BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
  * DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF
  * LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE
  * OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED
  * OF THE POSSIBILITY OF SUCH DAMAGE.
  * The original code has been modified by Geehy Semiconductor.
  * Copyright (c) 2017 STMicroelectronics. Copyright (C) 2023-2025 Geehy Semiconductor.
  * All rights reserved.
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  *
  @verbatim
  ==============================================================================
                     ##### How to use this driver #####
  ==============================================================================
    [..]
    The DDL SYSTEM driver contains a set of generic APIs that can be
    used by user:
      (+) Some of the FLASH features need to be handled in the SYSTEM file.
      (+) Access to DBGCMU registers
      (+) Access to SYSCFG registers

  @endverbatim
  *
  */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef APM32F4xx_DDL_SYSTEM_H
#define APM32F4xx_DDL_SYSTEM_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "apm32f4xx.h"

/** @addtogroup APM32F4xx_DDL_Driver
  * @{
  */

#if defined (FLASH) || defined (SYSCFG) || defined (DBGMCU)

/** @defgroup SYSTEM_DDL SYSTEM
  * @{
  */

/* Private types -------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/

/* Private constants ---------------------------------------------------------*/
/** @defgroup SYSTEM_DDL_Private_Constants SYSTEM Private Constants
  * @{
  */

/**
  * @}
  */

/* Private macros ------------------------------------------------------------*/

/* Exported types ------------------------------------------------------------*/
/* Exported constants --------------------------------------------------------*/
/** @defgroup SYSTEM_DDL_Exported_Constants SYSTEM Exported Constants
  * @{
  */
#if defined(SYSCFG)
/** @defgroup SYSTEM_DDL_EC_REMAP SYSCFG REMAP
* @{
*/
#define DDL_SYSCFG_REMAP_FLASH              (uint32_t)0x00000000                            /*!< Main Flash memory mapped at 0x00000000              */
#define DDL_SYSCFG_REMAP_SYSTEMFLASH        SYSCFG_MMSEL_MMSEL_0                            /*!< System Flash memory mapped at 0x00000000            */
#if defined(SMC_Bank1)
#define DDL_SYSCFG_REMAP_SMC                SYSCFG_MMSEL_MMSEL_1                            /*!< SMC(NOR/PSRAM 1 and 2) mapped at 0x00000000        */
#endif /* SMC_Bank1 */
#if defined(DMC)
#define DDL_SYSCFG_REMAP_DMC                SYSCFG_MMSEL_MMSEL_1                            /*!< DMC(SDRAM bank 1) mapped at 0x00000000        */
#endif /* DMC */

#define DDL_SYSCFG_REMAP_SRAM               (SYSCFG_MMSEL_MMSEL_1 | SYSCFG_MMSEL_MMSEL_0)   /*!< SRAM1 mapped at 0x00000000                          */

/**
  * @}
  */

#if defined(SYSCFG_PMCFG_ENETSEL)
 /** @defgroup SYSTEM_DDL_EC_PMC SYSCFG PMC
* @{
*/
#define DDL_SYSCFG_PMCFG_ETHMII               (uint32_t)0x00000000                             /*!< ETH Media MII interface */
#define DDL_SYSCFG_PMCFG_ETHRMII              (uint32_t)SYSCFG_PMCFG_ENETSEL                   /*!< ETH Media RMII interface */

/**
  * @}
  */
#endif /* SYSCFG_PMCFG_ENETSEL */

/** @defgroup SYSTEM_DDL_EC_EINT_PORT SYSCFG EINT PORT
  * @{
  */
#define DDL_SYSCFG_EINT_PORTA               (uint32_t)0               /*!< EINT PORT A                        */
#define DDL_SYSCFG_EINT_PORTB               (uint32_t)1               /*!< EINT PORT B                        */
#define DDL_SYSCFG_EINT_PORTC               (uint32_t)2               /*!< EINT PORT C                        */
#define DDL_SYSCFG_EINT_PORTD               (uint32_t)3               /*!< EINT PORT D                        */
#define DDL_SYSCFG_EINT_PORTE               (uint32_t)4               /*!< EINT PORT E                        */
#if defined(GPIOF)
#define DDL_SYSCFG_EINT_PORTF               (uint32_t)5               /*!< EINT PORT F                        */
#endif /* GPIOF */
#if defined(GPIOG)
#define DDL_SYSCFG_EINT_PORTG               (uint32_t)6               /*!< EINT PORT G                        */
#endif /* GPIOG */
#define DDL_SYSCFG_EINT_PORTH               (uint32_t)7               /*!< EINT PORT H                        */
#if defined(GPIOI)
#define DDL_SYSCFG_EINT_PORTI               (uint32_t)8               /*!< EINT PORT I                        */
#endif /* GPIOI */
#if defined(GPIOJ)
#define DDL_SYSCFG_EINT_PORTJ               (uint32_t)9               /*!< EINT PORT J                        */
#endif /* GPIOJ */
#if defined(GPIOK)
#define DDL_SYSCFG_EINT_PORTK               (uint32_t)10              /*!< EINT PORT k                        */
#endif /* GPIOK */
/**
  * @}
  */

/** @defgroup SYSTEM_DDL_EC_EINT_LINE SYSCFG EINT LINE
  * @{
  */
#define DDL_SYSCFG_EINT_LINE0               (uint32_t)(0x000FU << 16 | 0)  /*!< EINT_POSITION_0  | EINTCFG[0] */
#define DDL_SYSCFG_EINT_LINE1               (uint32_t)(0x00F0U << 16 | 0)  /*!< EINT_POSITION_4  | EINTCFG[0] */
#define DDL_SYSCFG_EINT_LINE2               (uint32_t)(0x0F00U << 16 | 0)  /*!< EINT_POSITION_8  | EINTCFG[0] */
#define DDL_SYSCFG_EINT_LINE3               (uint32_t)(0xF000U << 16 | 0)  /*!< EINT_POSITION_12 | EINTCFG[0] */
#define DDL_SYSCFG_EINT_LINE4               (uint32_t)(0x000FU << 16 | 1)  /*!< EINT_POSITION_0  | EINTCFG[1] */
#define DDL_SYSCFG_EINT_LINE5               (uint32_t)(0x00F0U << 16 | 1)  /*!< EINT_POSITION_4  | EINTCFG[1] */
#define DDL_SYSCFG_EINT_LINE6               (uint32_t)(0x0F00U << 16 | 1)  /*!< EINT_POSITION_8  | EINTCFG[1] */
#define DDL_SYSCFG_EINT_LINE7               (uint32_t)(0xF000U << 16 | 1)  /*!< EINT_POSITION_12 | EINTCFG[1] */
#define DDL_SYSCFG_EINT_LINE8               (uint32_t)(0x000FU << 16 | 2)  /*!< EINT_POSITION_0  | EINTCFG[2] */
#define DDL_SYSCFG_EINT_LINE9               (uint32_t)(0x00F0U << 16 | 2)  /*!< EINT_POSITION_4  | EINTCFG[2] */
#define DDL_SYSCFG_EINT_LINE10              (uint32_t)(0x0F00U << 16 | 2)  /*!< EINT_POSITION_8  | EINTCFG[2] */
#define DDL_SYSCFG_EINT_LINE11              (uint32_t)(0xF000U << 16 | 2)  /*!< EINT_POSITION_12 | EINTCFG[2] */
#define DDL_SYSCFG_EINT_LINE12              (uint32_t)(0x000FU << 16 | 3)  /*!< EINT_POSITION_0  | EINTCFG[3] */
#define DDL_SYSCFG_EINT_LINE13              (uint32_t)(0x00F0U << 16 | 3)  /*!< EINT_POSITION_4  | EINTCFG[3] */
#define DDL_SYSCFG_EINT_LINE14              (uint32_t)(0x0F00U << 16 | 3)  /*!< EINT_POSITION_8  | EINTCFG[3] */
#define DDL_SYSCFG_EINT_LINE15              (uint32_t)(0xF000U << 16 | 3)  /*!< EINT_POSITION_12 | EINTCFG[3] */
/**
  * @}
  */
#endif /* SYSCFG */

/** @defgroup SYSTEM_DDL_EC_TRACE DBGMCU TRACE Pin Assignment
  * @{
  */
#define DDL_DBGMCU_TRACE_NONE               0x00000000U                                       /*!< TRACE pins not assigned (default state) */
#define DDL_DBGMCU_TRACE_ASYNCH             DBGMCU_CFG_TRACE_IOEN                             /*!< TRACE pin assignment for Asynchronous Mode */
#define DDL_DBGMCU_TRACE_SYNCH_SIZE1        (DBGMCU_CFG_TRACE_IOEN | DBGMCU_CFG_TRACE_MODE_0) /*!< TRACE pin assignment for Synchronous Mode with a TRACEDATA size of 1 */
#define DDL_DBGMCU_TRACE_SYNCH_SIZE2        (DBGMCU_CFG_TRACE_IOEN | DBGMCU_CFG_TRACE_MODE_1) /*!< TRACE pin assignment for Synchronous Mode with a TRACEDATA size of 2 */
#define DDL_DBGMCU_TRACE_SYNCH_SIZE4        (DBGMCU_CFG_TRACE_IOEN | DBGMCU_CFG_TRACE_MODE)   /*!< TRACE pin assignment for Synchronous Mode with a TRACEDATA size of 4 */
/**
  * @}
  */

/** @defgroup SYSTEM_DDL_EC_APB1_GRP1_STOP_IP DBGMCU APB1 GRP1 STOP IP
  * @{
  */
#if defined(APM32F403xx) || defined(APM32F402xx)
#define DDL_DBGMCU_APB1_GRP1_TMR2_STOP      DBGMCU_CFG_TMR2_STS            /*!< TMR2 counter stopped when core is halted */
#define DDL_DBGMCU_APB1_GRP1_TMR3_STOP      DBGMCU_CFG_TMR3_STS            /*!< TMR3 counter stopped when core is halted */
#define DDL_DBGMCU_APB1_GRP1_TMR4_STOP      DBGMCU_CFG_TMR4_STS            /*!< TMR4 counter stopped when core is halted */
#define DDL_DBGMCU_APB1_GRP1_TMR5_STOP      DBGMCU_CFG_TMR5_STS            /*!< TMR5 counter stopped when core is halted */
#define DDL_DBGMCU_APB1_GRP1_WWDT_STOP      DBGMCU_CFG_WWDT_STS            /*!< Debug Window Watchdog stopped when Core is halted */
#define DDL_DBGMCU_APB1_GRP1_IWDT_STOP      DBGMCU_CFG_IWDT_STS            /*!< Debug Independent Watchdog stopped when Core is halted */
#define DDL_DBGMCU_APB1_GRP1_I2C1_STOP      DBGMCU_CFG_I2C1_SMBUS_TIMEOUT_STS /*!< I2C1 SMBUS timeout mode stopped when Core is halted */
#define DDL_DBGMCU_APB1_GRP1_CAN1_STOP      DBGMCU_CFG_CAN1_STS            /*!< CAN1 debug stopped when Core is halted  */
#define DDL_DBGMCU_APB1_GRP1_CAN2_STOP      DBGMCU_CFG_CAN2_STS            /*!< CAN2 debug stopped when Core is halted  */
#else
#if defined(DBGMCU_APB1F_TMR2_STS)
#define DDL_DBGMCU_APB1_GRP1_TMR2_STOP      DBGMCU_APB1F_TMR2_STS          /*!< TMR2 counter stopped when core is halted */
#endif /* DBGMCU_APB1F_TMR2_STS */
#if defined(DBGMCU_APB1F_TMR3_STS)
#define DDL_DBGMCU_APB1_GRP1_TMR3_STOP      DBGMCU_APB1F_TMR3_STS          /*!< TMR3 counter stopped when core is halted */
#endif /* DBGMCU_APB1F_TMR3_STS */
#if defined(DBGMCU_APB1F_TMR4_STS)
#define DDL_DBGMCU_APB1_GRP1_TMR4_STOP      DBGMCU_APB1F_TMR4_STS          /*!< TMR4 counter stopped when core is halted */
#endif /* DBGMCU_APB1F_TMR4_STS */
#define DDL_DBGMCU_APB1_GRP1_TMR5_STOP      DBGMCU_APB1F_TMR5_STS          /*!< TMR5 counter stopped when core is halted */
#if defined(DBGMCU_APB1F_TMR6_STS)
#define DDL_DBGMCU_APB1_GRP1_TMR6_STOP      DBGMCU_APB1F_TMR6_STS          /*!< TMR6 counter stopped when core is halted */
#endif /* DBGMCU_APB1F_TMR6_STS */
#if defined(DBGMCU_APB1F_TMR7_STS)
#define DDL_DBGMCU_APB1_GRP1_TMR7_STOP      DBGMCU_APB1F_TMR7_STS          /*!< TMR7 counter stopped when core is halted */
#endif /* DBGMCU_APB1F_TMR7_STOP */
#if defined(DBGMCU_APB1F_TMR12_STS)
#define DDL_DBGMCU_APB1_GRP1_TMR12_STOP     DBGMCU_APB1F_TMR12_STS         /*!< TMR12 counter stopped when core is halted */
#endif /* DBGMCU_APB1F_TMR12_STS */
#if defined(DBGMCU_APB1F_TMR13_STS)
#define DDL_DBGMCU_APB1_GRP1_TMR13_STOP     DBGMCU_APB1F_TMR13_STS         /*!< TMR13 counter stopped when core is halted */
#endif /* DBGMCU_APB1F_TMR13_STS */
#if defined(DBGMCU_APB1F_TMR14_STS)
#define DDL_DBGMCU_APB1_GRP1_TMR14_STOP     DBGMCU_APB1F_TMR14_STS         /*!< TMR14 counter stopped when core is halted */
#endif /* DBGMCU_APB1F_TMR14_STS */
#define DDL_DBGMCU_APB1_GRP1_RTC_STOP       DBGMCU_APB1F_RTC_STS           /*!< RTC counter stopped when core is halted */
#define DDL_DBGMCU_APB1_GRP1_WWDT_STOP      DBGMCU_APB1F_WWDT_STS          /*!< Debug Window Watchdog stopped when Core is halted */
#define DDL_DBGMCU_APB1_GRP1_IWDT_STOP      DBGMCU_APB1F_IWDT_STS          /*!< Debug Independent Watchdog stopped when Core is halted */
#define DDL_DBGMCU_APB1_GRP1_I2C1_STOP      DBGMCU_APB1F_I2C1_SMBUS_TIMEOUT_STS /*!< I2C1 SMBUS timeout mode stopped when Core is halted */
#define DDL_DBGMCU_APB1_GRP1_I2C2_STOP      DBGMCU_APB1F_I2C2_SMBUS_TIMEOUT_STS /*!< I2C2 SMBUS timeout mode stopped when Core is halted */
#if defined(DBGMCU_APB1F_I2C3_SMBUS_TIMEOUT_STS)
#define DDL_DBGMCU_APB1_GRP1_I2C3_STOP      DBGMCU_APB1F_I2C3_SMBUS_TIMEOUT_STS /*!< I2C3 SMBUS timeout mode stopped when Core is halted */
#endif /* DBGMCU_APB1F_I2C3_SMBUS_TIMEOUT_STS */
#if defined(DBGMCU_APB1F_CAN1_STS)
#define DDL_DBGMCU_APB1_GRP1_CAN1_STOP      DBGMCU_APB1F_CAN1_STS          /*!< CAN1 debug stopped when Core is halted  */
#endif /* DBGMCU_APB1F_CAN1_STS */
#if defined(DBGMCU_APB1F_CAN2_STS)
#define DDL_DBGMCU_APB1_GRP1_CAN2_STOP      DBGMCU_APB1F_CAN2_STS          /*!< CAN2 debug stopped when Core is halted  */
#endif /* DBGMCU_APB1F_CAN2_STS */
#endif /* APM32F403xx || APM32F402xx */
/**
  * @}
  */

/** @defgroup SYSTEM_DDL_EC_APB2_GRP1_STOP_IP DBGMCU APB2 GRP1 STOP IP
  * @{
  */
#if defined(APM32F403xx) || defined(APM32F402xx)
#define DDL_DBGMCU_APB2_GRP1_TMR1_STOP      DBGMCU_CFG_TMR1_STS     /*!< TMR1 counter stopped when core is halted */
#define DDL_DBGMCU_APB2_GRP1_TMR8_STOP      DBGMCU_CFG_TMR8_STS     /*!< TMR8 counter stopped when core is halted */
#else
#define DDL_DBGMCU_APB2_GRP1_TMR1_STOP      DBGMCU_APB2F_TMR1_STS   /*!< TMR1 counter stopped when core is halted */
#if defined(DBGMCU_APB2F_TMR8_STS)
#define DDL_DBGMCU_APB2_GRP1_TMR8_STOP      DBGMCU_APB2F_TMR8_STS   /*!< TMR8 counter stopped when core is halted */
#endif /* DBGMCU_APB2F_TMR8_STS */
#define DDL_DBGMCU_APB2_GRP1_TMR9_STOP      DBGMCU_APB2F_TMR9_STS   /*!< TMR9 counter stopped when core is halted */
#if defined(DBGMCU_APB2F_TMR10_STS)
#define DDL_DBGMCU_APB2_GRP1_TMR10_STOP     DBGMCU_APB2F_TMR10_STS  /*!< TMR10 counter stopped when core is halted */
#endif /* DBGMCU_APB2F_TMR10_STS */
#define DDL_DBGMCU_APB2_GRP1_TMR11_STOP     DBGMCU_APB2F_TMR11_STS  /*!< TMR11 counter stopped when core is halted */
#endif /* APM32F403xx || APM32F402xx */
/**
  * @}
  */

