betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Include/apm32f4xx_ddl_system.h
/** @defgroup SYSTEM_DDL_EC_LATENCY FLASH LATENCY
  * @{
  */
#if defined(APM32F403xx) || defined(APM32F402xx)
#define DDL_FLASH_LATENCY_0                 FLASH_CTRL_WS_0WS   /*!< FLASH Zero wait state */
#define DDL_FLASH_LATENCY_1                 FLASH_CTRL_WS_1WS   /*!< FLASH One wait state */
#define DDL_FLASH_LATENCY_2                 FLASH_CTRL_WS_2WS   /*!< FLASH Two wait states */
#define DDL_FLASH_LATENCY_3                 FLASH_CTRL_WS_3WS   /*!< FLASH Three wait states */
#define DDL_FLASH_LATENCY_4                 FLASH_CTRL_WS_4WS   /*!< FLASH Four wait states */
#define DDL_FLASH_LATENCY_5                 FLASH_CTRL_WS_5WS   /*!< FLASH five wait state */
#define DDL_FLASH_LATENCY_6                 FLASH_CTRL_WS_6WS   /*!< FLASH six wait state */
#define DDL_FLASH_LATENCY_7                 FLASH_CTRL_WS_7WS   /*!< FLASH seven wait states */
#define DDL_FLASH_LATENCY_8                 FLASH_CTRL_WS_8WS   /*!< FLASH eight wait states */
#define DDL_FLASH_LATENCY_9                 FLASH_CTRL_WS_9WS   /*!< FLASH nine wait states */
#define DDL_FLASH_LATENCY_10                FLASH_CTRL_WS_10WS  /*!< FLASH ten wait states */
#define DDL_FLASH_LATENCY_11                FLASH_CTRL_WS_11WS  /*!< FLASH eleven wait states */
#define DDL_FLASH_LATENCY_12                FLASH_CTRL_WS_12WS  /*!< FLASH twelve wait states */
#define DDL_FLASH_LATENCY_13                FLASH_CTRL_WS_13WS  /*!< FLASH thirteen wait states */
#define DDL_FLASH_LATENCY_14                FLASH_CTRL_WS_14WS  /*!< FLASH fourteen wait states */
#define DDL_FLASH_LATENCY_15                FLASH_CTRL_WS_15WS  /*!< FLASH fifteen wait states */
#define DDL_FLASH_LATENCY_16                FLASH_CTRL_WS_16WS  /*!< FLASH sixteen wait states */
#define DDL_FLASH_LATENCY_17                FLASH_CTRL_WS_17WS  /*!< FLASH seventeen wait states */
#define DDL_FLASH_LATENCY_18                FLASH_CTRL_WS_18WS  /*!< FLASH eighteen wait states */
#define DDL_FLASH_LATENCY_19                FLASH_CTRL_WS_19WS  /*!< FLASH nineteen wait states */
#define DDL_FLASH_LATENCY_20                FLASH_CTRL_WS_20WS  /*!< FLASH twenty wait states */
#define DDL_FLASH_LATENCY_21                FLASH_CTRL_WS_21WS  /*!< FLASH twenty one wait states */
#define DDL_FLASH_LATENCY_22                FLASH_CTRL_WS_22WS  /*!< FLASH twenty two wait states */
#define DDL_FLASH_LATENCY_23                FLASH_CTRL_WS_23WS  /*!< FLASH twenty three wait states */
#define DDL_FLASH_LATENCY_24                FLASH_CTRL_WS_24WS  /*!< FLASH twenty four wait states */
#define DDL_FLASH_LATENCY_25                FLASH_CTRL_WS_25WS  /*!< FLASH twenty five wait states */
#define DDL_FLASH_LATENCY_26                FLASH_CTRL_WS_26WS  /*!< FLASH twenty six wait states */
#define DDL_FLASH_LATENCY_27                FLASH_CTRL_WS_27WS  /*!< FLASH twenty seven wait states */
#define DDL_FLASH_LATENCY_28                FLASH_CTRL_WS_28WS  /*!< FLASH twenty eight wait states */
#define DDL_FLASH_LATENCY_29                FLASH_CTRL_WS_29WS  /*!< FLASH twenty nine wait states */
#define DDL_FLASH_LATENCY_30                FLASH_CTRL_WS_30WS  /*!< FLASH thirty wait states */
#define DDL_FLASH_LATENCY_31                FLASH_CTRL_WS_31WS  /*!< FLASH thirty one wait states */
#else
#define DDL_FLASH_LATENCY_0                 FLASH_ACCTRL_WAITP_0WS   /*!< FLASH Zero wait state */
#define DDL_FLASH_LATENCY_1                 FLASH_ACCTRL_WAITP_1WS   /*!< FLASH One wait state */
#define DDL_FLASH_LATENCY_2                 FLASH_ACCTRL_WAITP_2WS   /*!< FLASH Two wait states */
#define DDL_FLASH_LATENCY_3                 FLASH_ACCTRL_WAITP_3WS   /*!< FLASH Three wait states */
#define DDL_FLASH_LATENCY_4                 FLASH_ACCTRL_WAITP_4WS   /*!< FLASH Four wait states */
#define DDL_FLASH_LATENCY_5                 FLASH_ACCTRL_WAITP_5WS   /*!< FLASH five wait state */
#define DDL_FLASH_LATENCY_6                 FLASH_ACCTRL_WAITP_6WS   /*!< FLASH six wait state */
#define DDL_FLASH_LATENCY_7                 FLASH_ACCTRL_WAITP_7WS   /*!< FLASH seven wait states */
#if defined(APM32F423xx) || defined(APM32F425xx) || defined(APM32F427xx)
#define DDL_FLASH_LATENCY_8                 FLASH_ACCTRL_WAITP_8WS
#define DDL_FLASH_LATENCY_9                 FLASH_ACCTRL_WAITP_9WS
#define DDL_FLASH_LATENCY_10                FLASH_ACCTRL_WAITP_10WS
#define DDL_FLASH_LATENCY_11                FLASH_ACCTRL_WAITP_11WS
#define DDL_FLASH_LATENCY_12                FLASH_ACCTRL_WAITP_12WS
#define DDL_FLASH_LATENCY_13                FLASH_ACCTRL_WAITP_13WS
#define DDL_FLASH_LATENCY_14                FLASH_ACCTRL_WAITP_14WS
#define DDL_FLASH_LATENCY_15                FLASH_ACCTRL_WAITP_15WS
#define DDL_FLASH_LATENCY_16                FLASH_ACCTRL_WAITP_16WS
#define DDL_FLASH_LATENCY_17                FLASH_ACCTRL_WAITP_17WS
#define DDL_FLASH_LATENCY_18                FLASH_ACCTRL_WAITP_18WS
#define DDL_FLASH_LATENCY_19                FLASH_ACCTRL_WAITP_19WS
#define DDL_FLASH_LATENCY_20                FLASH_ACCTRL_WAITP_20WS
#define DDL_FLASH_LATENCY_21                FLASH_ACCTRL_WAITP_21WS
#define DDL_FLASH_LATENCY_22                FLASH_ACCTRL_WAITP_22WS
#define DDL_FLASH_LATENCY_23                FLASH_ACCTRL_WAITP_23WS
#define DDL_FLASH_LATENCY_24                FLASH_ACCTRL_WAITP_24WS
#define DDL_FLASH_LATENCY_25                FLASH_ACCTRL_WAITP_25WS
#define DDL_FLASH_LATENCY_26                FLASH_ACCTRL_WAITP_26WS
#define DDL_FLASH_LATENCY_27                FLASH_ACCTRL_WAITP_27WS
#define DDL_FLASH_LATENCY_28                FLASH_ACCTRL_WAITP_28WS
#define DDL_FLASH_LATENCY_29                FLASH_ACCTRL_WAITP_29WS
#define DDL_FLASH_LATENCY_30                FLASH_ACCTRL_WAITP_30WS
#define DDL_FLASH_LATENCY_31                FLASH_ACCTRL_WAITP_31WS
#define DDL_FLASH_LATENCY_32                FLASH_ACCTRL_WAITP_32WS
#define DDL_FLASH_LATENCY_33                FLASH_ACCTRL_WAITP_33WS
#define DDL_FLASH_LATENCY_34                FLASH_ACCTRL_WAITP_34WS
#define DDL_FLASH_LATENCY_35                FLASH_ACCTRL_WAITP_35WS
#define DDL_FLASH_LATENCY_36                FLASH_ACCTRL_WAITP_36WS
#define DDL_FLASH_LATENCY_37                FLASH_ACCTRL_WAITP_37WS
#define DDL_FLASH_LATENCY_38                FLASH_ACCTRL_WAITP_38WS
#define DDL_FLASH_LATENCY_39                FLASH_ACCTRL_WAITP_39WS
#define DDL_FLASH_LATENCY_40                FLASH_ACCTRL_WAITP_40WS
#define DDL_FLASH_LATENCY_41                FLASH_ACCTRL_WAITP_41WS
#define DDL_FLASH_LATENCY_42                FLASH_ACCTRL_WAITP_42WS
#define DDL_FLASH_LATENCY_43                FLASH_ACCTRL_WAITP_43WS
#define DDL_FLASH_LATENCY_44                FLASH_ACCTRL_WAITP_44WS
#define DDL_FLASH_LATENCY_45                FLASH_ACCTRL_WAITP_45WS
#define DDL_FLASH_LATENCY_46                FLASH_ACCTRL_WAITP_46WS
#define DDL_FLASH_LATENCY_47                FLASH_ACCTRL_WAITP_47WS
#define DDL_FLASH_LATENCY_48                FLASH_ACCTRL_WAITP_48WS
#define DDL_FLASH_LATENCY_49                FLASH_ACCTRL_WAITP_49WS
#define DDL_FLASH_LATENCY_50                FLASH_ACCTRL_WAITP_50WS
#define DDL_FLASH_LATENCY_51                FLASH_ACCTRL_WAITP_51WS
#define DDL_FLASH_LATENCY_52                FLASH_ACCTRL_WAITP_52WS
#define DDL_FLASH_LATENCY_53                FLASH_ACCTRL_WAITP_53WS
#define DDL_FLASH_LATENCY_54                FLASH_ACCTRL_WAITP_54WS
#define DDL_FLASH_LATENCY_55                FLASH_ACCTRL_WAITP_55WS
#define DDL_FLASH_LATENCY_56                FLASH_ACCTRL_WAITP_56WS
#define DDL_FLASH_LATENCY_57                FLASH_ACCTRL_WAITP_57WS
#define DDL_FLASH_LATENCY_58                FLASH_ACCTRL_WAITP_58WS
#define DDL_FLASH_LATENCY_59                FLASH_ACCTRL_WAITP_59WS
#define DDL_FLASH_LATENCY_60                FLASH_ACCTRL_WAITP_60WS
#define DDL_FLASH_LATENCY_61                FLASH_ACCTRL_WAITP_61WS
#define DDL_FLASH_LATENCY_62                FLASH_ACCTRL_WAITP_62WS
#define DDL_FLASH_LATENCY_63                FLASH_ACCTRL_WAITP_63WS
#define DDL_FLASH_LATENCY_64                FLASH_ACCTRL_WAITP_64WS
#define DDL_FLASH_LATENCY_65                FLASH_ACCTRL_WAITP_65WS
#define DDL_FLASH_LATENCY_66                FLASH_ACCTRL_WAITP_66WS
#define DDL_FLASH_LATENCY_67                FLASH_ACCTRL_WAITP_67WS
#define DDL_FLASH_LATENCY_68                FLASH_ACCTRL_WAITP_68WS
#define DDL_FLASH_LATENCY_69                FLASH_ACCTRL_WAITP_69WS
#define DDL_FLASH_LATENCY_70                FLASH_ACCTRL_WAITP_70WS
#define DDL_FLASH_LATENCY_71                FLASH_ACCTRL_WAITP_71WS
#define DDL_FLASH_LATENCY_72                FLASH_ACCTRL_WAITP_72WS
#define DDL_FLASH_LATENCY_73                FLASH_ACCTRL_WAITP_73WS
#define DDL_FLASH_LATENCY_74                FLASH_ACCTRL_WAITP_74WS
#define DDL_FLASH_LATENCY_75                FLASH_ACCTRL_WAITP_75WS
#define DDL_FLASH_LATENCY_76                FLASH_ACCTRL_WAITP_76WS
#define DDL_FLASH_LATENCY_77                FLASH_ACCTRL_WAITP_77WS
#define DDL_FLASH_LATENCY_78                FLASH_ACCTRL_WAITP_78WS
#define DDL_FLASH_LATENCY_79                FLASH_ACCTRL_WAITP_79WS
#define DDL_FLASH_LATENCY_80                FLASH_ACCTRL_WAITP_80WS
#define DDL_FLASH_LATENCY_81                FLASH_ACCTRL_WAITP_81WS
#define DDL_FLASH_LATENCY_82                FLASH_ACCTRL_WAITP_82WS
#define DDL_FLASH_LATENCY_83                FLASH_ACCTRL_WAITP_83WS
#define DDL_FLASH_LATENCY_84                FLASH_ACCTRL_WAITP_84WS
#define DDL_FLASH_LATENCY_85                FLASH_ACCTRL_WAITP_85WS
#define DDL_FLASH_LATENCY_86                FLASH_ACCTRL_WAITP_86WS
#define DDL_FLASH_LATENCY_87                FLASH_ACCTRL_WAITP_87WS
#define DDL_FLASH_LATENCY_88                FLASH_ACCTRL_WAITP_88WS
#define DDL_FLASH_LATENCY_89                FLASH_ACCTRL_WAITP_89WS
#define DDL_FLASH_LATENCY_90                FLASH_ACCTRL_WAITP_90WS
#define DDL_FLASH_LATENCY_91                FLASH_ACCTRL_WAITP_91WS
#define DDL_FLASH_LATENCY_92                FLASH_ACCTRL_WAITP_92WS
#define DDL_FLASH_LATENCY_93                FLASH_ACCTRL_WAITP_93WS
#define DDL_FLASH_LATENCY_94                FLASH_ACCTRL_WAITP_94WS
#define DDL_FLASH_LATENCY_95                FLASH_ACCTRL_WAITP_95WS
#define DDL_FLASH_LATENCY_96                FLASH_ACCTRL_WAITP_96WS
#define DDL_FLASH_LATENCY_97                FLASH_ACCTRL_WAITP_97WS
#define DDL_FLASH_LATENCY_98                FLASH_ACCTRL_WAITP_98WS
#define DDL_FLASH_LATENCY_99                FLASH_ACCTRL_WAITP_99WS
#define DDL_FLASH_LATENCY_100               FLASH_ACCTRL_WAITP_100WS
#define DDL_FLASH_LATENCY_101               FLASH_ACCTRL_WAITP_101WS
#define DDL_FLASH_LATENCY_102               FLASH_ACCTRL_WAITP_102WS
#define DDL_FLASH_LATENCY_103               FLASH_ACCTRL_WAITP_103WS
#define DDL_FLASH_LATENCY_104               FLASH_ACCTRL_WAITP_104WS
#define DDL_FLASH_LATENCY_105               FLASH_ACCTRL_WAITP_105WS
#define DDL_FLASH_LATENCY_106               FLASH_ACCTRL_WAITP_106WS
#define DDL_FLASH_LATENCY_107               FLASH_ACCTRL_WAITP_107WS
#define DDL_FLASH_LATENCY_108               FLASH_ACCTRL_WAITP_108WS
#define DDL_FLASH_LATENCY_109               FLASH_ACCTRL_WAITP_109WS
#define DDL_FLASH_LATENCY_110               FLASH_ACCTRL_WAITP_110WS
#define DDL_FLASH_LATENCY_111               FLASH_ACCTRL_WAITP_111WS
#define DDL_FLASH_LATENCY_112               FLASH_ACCTRL_WAITP_112WS
#define DDL_FLASH_LATENCY_113               FLASH_ACCTRL_WAITP_113WS
#define DDL_FLASH_LATENCY_114               FLASH_ACCTRL_WAITP_114WS
#define DDL_FLASH_LATENCY_115               FLASH_ACCTRL_WAITP_115WS
#define DDL_FLASH_LATENCY_116               FLASH_ACCTRL_WAITP_116WS
#define DDL_FLASH_LATENCY_117               FLASH_ACCTRL_WAITP_117WS
#define DDL_FLASH_LATENCY_118               FLASH_ACCTRL_WAITP_118WS
#define DDL_FLASH_LATENCY_119               FLASH_ACCTRL_WAITP_119WS
#define DDL_FLASH_LATENCY_120               FLASH_ACCTRL_WAITP_120WS
#define DDL_FLASH_LATENCY_121               FLASH_ACCTRL_WAITP_121WS
#define DDL_FLASH_LATENCY_122               FLASH_ACCTRL_WAITP_122WS
#define DDL_FLASH_LATENCY_123               FLASH_ACCTRL_WAITP_123WS
#define DDL_FLASH_LATENCY_124               FLASH_ACCTRL_WAITP_124WS
#define DDL_FLASH_LATENCY_125               FLASH_ACCTRL_WAITP_125WS
#define DDL_FLASH_LATENCY_126               FLASH_ACCTRL_WAITP_126WS
#define DDL_FLASH_LATENCY_127               FLASH_ACCTRL_WAITP_127WS
#endif /* APM32F423xx || APM32F425xx || APM32F427xx */
#endif /* APM32F403xx || APM32F402xx */
/**
  * @}
  */

/** @defgroup SYSTEM_DDL_EC_READ_INT_TIME FLASH Read Interrupt Time
  * @{
  */
#if defined(FLASH_ACCTRL_RD_INT_TIMING)
#define DDL_FLASH_TRC_FAST              0x00000000U                 /*!< FLASH Read Interrupt Timing Fast */
#define DDL_FLASH_TRC_SLOW              FLASH_ACCTRL_RD_INT_TIMING  /*!< FLASH Read Interrupt Timing Slow */
#endif /* FLASH_ACCTRL_RD_INT_TIMING */
/**
  * @}
  */

/**
  * @}
  */

/* Exported macro ------------------------------------------------------------*/

/* Exported functions --------------------------------------------------------*/
/** @defgroup SYSTEM_DDL_Exported_Functions SYSTEM Exported Functions
  * @{
  */
#if defined(SYSCFG)
/** @defgroup SYSTEM_DDL_EF_SYSCFG SYSCFG
  * @{
  */
/**
  * @brief  Set memory mapping at address 0x00000000
  * @param  Memory This parameter can be one of the following values:
  *         @arg @ref DDL_SYSCFG_REMAP_FLASH
  *         @arg @ref DDL_SYSCFG_REMAP_SYSTEMFLASH
  *         @arg @ref DDL_SYSCFG_REMAP_SRAM
  *         @arg @ref DDL_SYSCFG_REMAP_SMC (*)
  *         @arg @ref DDL_SYSCFG_REMAP_DMC (*)
  * @retval None
  */
__STATIC_INLINE void DDL_SYSCFG_SetRemapMemory(uint32_t Memory)
{
  MODIFY_REG(SYSCFG->MMSEL, SYSCFG_MMSEL_MMSEL, Memory);
}

/**
  * @brief  Get memory mapping at address 0x00000000
  * @retval Returned value can be one of the following values:
  *         @arg @ref DDL_SYSCFG_REMAP_FLASH
  *         @arg @ref DDL_SYSCFG_REMAP_SYSTEMFLASH
  *         @arg @ref DDL_SYSCFG_REMAP_SRAM
  *         @arg @ref DDL_SYSCFG_REMAP_SMC (*)
  *         @arg @ref DDL_SYSCFG_REMAP_DMC (*)
  */
__STATIC_INLINE uint32_t DDL_SYSCFG_GetRemapMemory(void)
{
  return (uint32_t)(READ_BIT(SYSCFG->MMSEL, SYSCFG_MMSEL_MMSEL));
}

/**
  * @brief  Enables the Compensation cell Power Down
  * @note   The I/O compensation cell can be used only when the device supply
  *         voltage ranges from 2.4 to 3.6 V
  * @retval None
  */
__STATIC_INLINE void DDL_SYSCFG_EnableCompensationCell(void)
{
  SET_BIT(SYSCFG->CCCTRL, SYSCFG_CCCTRL_CCPD);
}

/**
  * @brief  Disables the Compensation cell Power Down
  * @note   The I/O compensation cell can be used only when the device supply
  *         voltage ranges from 2.4 to 3.6 V
  * @retval None
  */
__STATIC_INLINE void DDL_SYSCFG_DisableCompensationCell(void)
{
  CLEAR_BIT(SYSCFG->CCCTRL, SYSCFG_CCCTRL_CCPD);
}

/**
  * @brief  Get Compensation Cell ready Flag
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t DDL_SYSCFG_IsActiveFlag_CMPCR(void)
{
  return (READ_BIT(SYSCFG->CCCTRL, SYSCFG_CCCTRL_RDYFLG) == (SYSCFG_CCCTRL_RDYFLG));
}

#if defined(SYSCFG_PMCFG_ENETSEL)
/**
  * @brief  Select Ethernet PHY interface
  * @param  Interface This parameter can be one of the following values:
  *         @arg @ref DDL_SYSCFG_PMCFG_ETHMII
  *         @arg @ref DDL_SYSCFG_PMCFG_ETHRMII
  * @retval None
  */
__STATIC_INLINE void DDL_SYSCFG_SetPHYInterface(uint32_t Interface)
{
  MODIFY_REG(SYSCFG->PMCFG, SYSCFG_PMCFG_ENETSEL, Interface);
}

/**
  * @brief  Get Ethernet PHY interface
  * @retval Returned value can be one of the following values:
  *         @arg @ref DDL_SYSCFG_PMCFG_ETHMII
  *         @arg @ref DDL_SYSCFG_PMCFG_ETHRMII
  * @retval None
  */
__STATIC_INLINE uint32_t DDL_SYSCFG_GetPHYInterface(void)
{
  return (uint32_t)(READ_BIT(SYSCFG->PMCFG, SYSCFG_PMCFG_ENETSEL));
}
#endif /* SYSCFG_PMCFG_ENETSEL */


/**
  * @brief  Configure source input for the EINT external interrupt.
  * @param  Port This parameter can be one of the following values:
  *         @arg @ref DDL_SYSCFG_EINT_PORTA
  *         @arg @ref DDL_SYSCFG_EINT_PORTB
  *         @arg @ref DDL_SYSCFG_EINT_PORTC
  *         @arg @ref DDL_SYSCFG_EINT_PORTD
  *         @arg @ref DDL_SYSCFG_EINT_PORTE
  *         @arg @ref DDL_SYSCFG_EINT_PORTF (*)
  *         @arg @ref DDL_SYSCFG_EINT_PORTG (*)
  *         @arg @ref DDL_SYSCFG_EINT_PORTH
  *
  *         (*) value not defined in all devices
  * @param  Line This parameter can be one of the following values:
  *         @arg @ref DDL_SYSCFG_EINT_LINE0
  *         @arg @ref DDL_SYSCFG_EINT_LINE1
  *         @arg @ref DDL_SYSCFG_EINT_LINE2
  *         @arg @ref DDL_SYSCFG_EINT_LINE3
  *         @arg @ref DDL_SYSCFG_EINT_LINE4
  *         @arg @ref DDL_SYSCFG_EINT_LINE5
  *         @arg @ref DDL_SYSCFG_EINT_LINE6
  *         @arg @ref DDL_SYSCFG_EINT_LINE7
  *         @arg @ref DDL_SYSCFG_EINT_LINE8
  *         @arg @ref DDL_SYSCFG_EINT_LINE9
  *         @arg @ref DDL_SYSCFG_EINT_LINE10
  *         @arg @ref DDL_SYSCFG_EINT_LINE11
  *         @arg @ref DDL_SYSCFG_EINT_LINE12
  *         @arg @ref DDL_SYSCFG_EINT_LINE13
  *         @arg @ref DDL_SYSCFG_EINT_LINE14
  *         @arg @ref DDL_SYSCFG_EINT_LINE15
  * @retval None
  */
__STATIC_INLINE void DDL_SYSCFG_SetEINTSource(uint32_t Port, uint32_t Line)
{
  MODIFY_REG(SYSCFG->EINTCFG[Line & 0xFF], (Line >> 16), Port << POSITION_VAL((Line >> 16)));
}

/**
  * @brief  Get the configured defined for specific EINT Line
  * @param  Line This parameter can be one of the following values:
  *         @arg @ref DDL_SYSCFG_EINT_LINE0
  *         @arg @ref DDL_SYSCFG_EINT_LINE1
  *         @arg @ref DDL_SYSCFG_EINT_LINE2
  *         @arg @ref DDL_SYSCFG_EINT_LINE3
  *         @arg @ref DDL_SYSCFG_EINT_LINE4
  *         @arg @ref DDL_SYSCFG_EINT_LINE5
  *         @arg @ref DDL_SYSCFG_EINT_LINE6
  *         @arg @ref DDL_SYSCFG_EINT_LINE7
  *         @arg @ref DDL_SYSCFG_EINT_LINE8
  *         @arg @ref DDL_SYSCFG_EINT_LINE9
  *         @arg @ref DDL_SYSCFG_EINT_LINE10
  *         @arg @ref DDL_SYSCFG_EINT_LINE11
  *         @arg @ref DDL_SYSCFG_EINT_LINE12
  *         @arg @ref DDL_SYSCFG_EINT_LINE13
  *         @arg @ref DDL_SYSCFG_EINT_LINE14
  *         @arg @ref DDL_SYSCFG_EINT_LINE15
  * @retval Returned value can be one of the following values:
  *         @arg @ref DDL_SYSCFG_EINT_PORTA
  *         @arg @ref DDL_SYSCFG_EINT_PORTB
  *         @arg @ref DDL_SYSCFG_EINT_PORTC
  *         @arg @ref DDL_SYSCFG_EINT_PORTD
  *         @arg @ref DDL_SYSCFG_EINT_PORTE
  *         @arg @ref DDL_SYSCFG_EINT_PORTF (*)
  *         @arg @ref DDL_SYSCFG_EINT_PORTG (*)
  *         @arg @ref DDL_SYSCFG_EINT_PORTH
  *         (*) value not defined in all devices
  */
__STATIC_INLINE uint32_t DDL_SYSCFG_GetEINTSource(uint32_t Line)
{
  return (uint32_t)(READ_BIT(SYSCFG->EINTCFG[Line & 0xFF], (Line >> 16)) >> POSITION_VAL(Line >> 16));
}

/**
  * @}
  */
#endif /* SYSCFG */


/** @defgroup SYSTEM_DDL_EF_DBGMCU DBGMCU
  * @{
  */

/**
  * @brief  Return the device identifier
  * @note For APM32F405/407xx and APM32F415/417xx devices, the device ID is 0x413
  * @note For APM32F411xx devices, the device ID is 0x431
  * @note For APM32F423/425/427xx devices, the device ID is 0x419
  * @retval Values between Min_Data=0x00 and Max_Data=0xFFF
  */
__STATIC_INLINE uint32_t DDL_DBGMCU_GetDeviceID(void)
{
  return (uint32_t)(READ_BIT(DBGMCU->IDCODE, DBGMCU_IDCODE_EQR));
}

/**
  * @brief  Return the device revision identifier
  * @note This field indicates the revision of the device.
          For example, it is read as RevA -> 0x1000, Cat 2 revZ -> 0x1001, rev1 -> 0x1003, rev2 ->0x1007, revY -> 0x100F for APM32F405/407xx and APM32F417xx devices
          For example, it is read as RevA -> 0x0015 for APM32F411xx devices
          For example, it is read as RevA -> 0x1000 for APM32F423/425/427xx devices
  * @retval Values between Min_Data=0x00 and Max_Data=0xFFFF
  */
__STATIC_INLINE uint32_t DDL_DBGMCU_GetRevisionID(void)
{
  return (uint32_t)(READ_BIT(DBGMCU->IDCODE, DBGMCU_IDCODE_WVR) >> DBGMCU_IDCODE_WVR_Pos);
}

/**
  * @brief  Enable the Debug Module during SLEEP mode
  * @retval None
  */
__STATIC_INLINE void DDL_DBGMCU_EnableDBGSleepMode(void)
{
  SET_BIT(DBGMCU->CFG, DBGMCU_CFG_SLEEP_CLK_STS);
}

/**
  * @brief  Disable the Debug Module during SLEEP mode
  * @retval None
  */
__STATIC_INLINE void DDL_DBGMCU_DisableDBGSleepMode(void)
{
  CLEAR_BIT(DBGMCU->CFG, DBGMCU_CFG_SLEEP_CLK_STS);
}

/**
  * @brief  Enable the Debug Module during STOP mode
  * @retval None
  */
__STATIC_INLINE void DDL_DBGMCU_EnableDBGStopMode(void)
{
  SET_BIT(DBGMCU->CFG, DBGMCU_CFG_STOP_CLK_STS);
}

/**
  * @brief  Disable the Debug Module during STOP mode
  * @retval None
  */
__STATIC_INLINE void DDL_DBGMCU_DisableDBGStopMode(void)
{
  CLEAR_BIT(DBGMCU->CFG, DBGMCU_CFG_STOP_CLK_STS);
}

/**
  * @brief  Enable the Debug Module during STANDBY mode
  * @retval None
  */
__STATIC_INLINE void DDL_DBGMCU_EnableDBGStandbyMode(void)
{
  SET_BIT(DBGMCU->CFG, DBGMCU_CFG_STANDBY_CLK_STS);
}

/**
  * @brief  Disable the Debug Module during STANDBY mode
  * @retval None
  */
__STATIC_INLINE void DDL_DBGMCU_DisableDBGStandbyMode(void)
{
  CLEAR_BIT(DBGMCU->CFG, DBGMCU_CFG_STANDBY_CLK_STS);
}

/**
  * @brief  Set Trace pin assignment control
  * @param  PinAssignment This parameter can be one of the following values:
  *         @arg @ref DDL_DBGMCU_TRACE_NONE
  *         @arg @ref DDL_DBGMCU_TRACE_ASYNCH
  *         @arg @ref DDL_DBGMCU_TRACE_SYNCH_SIZE1
  *         @arg @ref DDL_DBGMCU_TRACE_SYNCH_SIZE2
  *         @arg @ref DDL_DBGMCU_TRACE_SYNCH_SIZE4
  * @retval None
  */
__STATIC_INLINE void DDL_DBGMCU_SetTracePinAssignment(uint32_t PinAssignment)
{
  MODIFY_REG(DBGMCU->CFG, DBGMCU_CFG_TRACE_IOEN | DBGMCU_CFG_TRACE_MODE, PinAssignment);
}

/**
  * @brief  Get Trace pin assignment control
  * @retval Returned value can be one of the following values:
  *         @arg @ref DDL_DBGMCU_TRACE_NONE
  *         @arg @ref DDL_DBGMCU_TRACE_ASYNCH
  *         @arg @ref DDL_DBGMCU_TRACE_SYNCH_SIZE1
  *         @arg @ref DDL_DBGMCU_TRACE_SYNCH_SIZE2
  *         @arg @ref DDL_DBGMCU_TRACE_SYNCH_SIZE4
  */
__STATIC_INLINE uint32_t DDL_DBGMCU_GetTracePinAssignment(void)
{
  return (uint32_t)(READ_BIT(DBGMCU->CFG, DBGMCU_CFG_TRACE_IOEN | DBGMCU_CFG_TRACE_MODE));
}

