betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Include/apm32f4xx_ddl_system.h
/**
  * @brief  Freeze APB1 peripherals (group1 peripherals)
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref DDL_DBGMCU_APB1_GRP1_TMR2_STOP (*)
  *         @arg @ref DDL_DBGMCU_APB1_GRP1_TMR3_STOP (*)
  *         @arg @ref DDL_DBGMCU_APB1_GRP1_TMR4_STOP (*)
  *         @arg @ref DDL_DBGMCU_APB1_GRP1_TMR5_STOP
  *         @arg @ref DDL_DBGMCU_APB1_GRP1_TMR6_STOP (*)
  *         @arg @ref DDL_DBGMCU_APB1_GRP1_TMR7_STOP (*)
  *         @arg @ref DDL_DBGMCU_APB1_GRP1_TMR12_STOP (*)
  *         @arg @ref DDL_DBGMCU_APB1_GRP1_TMR13_STOP (*)
  *         @arg @ref DDL_DBGMCU_APB1_GRP1_TMR14_STOP (*)
  *         @arg @ref DDL_DBGMCU_APB1_GRP1_RTC_STOP
  *         @arg @ref DDL_DBGMCU_APB1_GRP1_WWDT_STOP
  *         @arg @ref DDL_DBGMCU_APB1_GRP1_IWDT_STOP
  *         @arg @ref DDL_DBGMCU_APB1_GRP1_I2C1_STOP
  *         @arg @ref DDL_DBGMCU_APB1_GRP1_I2C2_STOP
  *         @arg @ref DDL_DBGMCU_APB1_GRP1_I2C3_STOP (*)
  *         @arg @ref DDL_DBGMCU_APB1_GRP1_CAN1_STOP (*)
  *         @arg @ref DDL_DBGMCU_APB1_GRP1_CAN2_STOP (*)
  *
  * @param  Periphs This parameter can be a combination of the following values(Only for APM32F402/403xx device):
  *         @arg @ref DDL_DBGMCU_APB1_GRP1_TMR2_STOP
  *         @arg @ref DDL_DBGMCU_APB1_GRP1_TMR3_STOP
  *         @arg @ref DDL_DBGMCU_APB1_GRP1_TMR4_STOP
  *         @arg @ref DDL_DBGMCU_APB1_GRP1_TMR5_STOP
  *         @arg @ref DDL_DBGMCU_APB1_GRP1_WWDT_STOP
  *         @arg @ref DDL_DBGMCU_APB1_GRP1_IWDT_STOP
  *         @arg @ref DDL_DBGMCU_APB1_GRP1_I2C1_STOP
  *         @arg @ref DDL_DBGMCU_APB1_GRP1_CAN1_STOP
  *         @arg @ref DDL_DBGMCU_APB1_GRP1_CAN2_STOP
  *
  *         (*) value not defined in all devices.
  * @retval None
  */
__STATIC_INLINE void DDL_DBGMCU_APB1_GRP1_FreezePeriph(uint32_t Periphs)
{
#if defined(APM32F403xx) || defined(APM32F402xx)
  SET_BIT(DBGMCU->CFG, Periphs);
#else
  SET_BIT(DBGMCU->APB1F, Periphs);
#endif /* APM32F403xx || APM32F402xx */
}

/**
  * @brief  Unfreeze APB1 peripherals (group1 peripherals)
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref DDL_DBGMCU_APB1_GRP1_TMR2_STOP (*)
  *         @arg @ref DDL_DBGMCU_APB1_GRP1_TMR3_STOP (*)
  *         @arg @ref DDL_DBGMCU_APB1_GRP1_TMR4_STOP (*)
  *         @arg @ref DDL_DBGMCU_APB1_GRP1_TMR5_STOP
  *         @arg @ref DDL_DBGMCU_APB1_GRP1_TMR6_STOP (*)
  *         @arg @ref DDL_DBGMCU_APB1_GRP1_TMR7_STOP (*)
  *         @arg @ref DDL_DBGMCU_APB1_GRP1_TMR12_STOP (*)
  *         @arg @ref DDL_DBGMCU_APB1_GRP1_TMR13_STOP (*)
  *         @arg @ref DDL_DBGMCU_APB1_GRP1_TMR14_STOP (*)
  *         @arg @ref DDL_DBGMCU_APB1_GRP1_RTC_STOP
  *         @arg @ref DDL_DBGMCU_APB1_GRP1_WWDT_STOP
  *         @arg @ref DDL_DBGMCU_APB1_GRP1_IWDT_STOP
  *         @arg @ref DDL_DBGMCU_APB1_GRP1_I2C1_STOP
  *         @arg @ref DDL_DBGMCU_APB1_GRP1_I2C2_STOP
  *         @arg @ref DDL_DBGMCU_APB1_GRP1_I2C3_STOP (*)
  *         @arg @ref DDL_DBGMCU_APB1_GRP1_CAN1_STOP (*)
  *         @arg @ref DDL_DBGMCU_APB1_GRP1_CAN2_STOP (*)
  *
  * @param  Periphs This parameter can be a combination of the following values(Only for APM32F402/403xx device):
  *         @arg @ref DDL_DBGMCU_APB1_GRP1_TMR2_STOP
  *         @arg @ref DDL_DBGMCU_APB1_GRP1_TMR3_STOP
  *         @arg @ref DDL_DBGMCU_APB1_GRP1_TMR4_STOP
  *         @arg @ref DDL_DBGMCU_APB1_GRP1_TMR5_STOP
  *         @arg @ref DDL_DBGMCU_APB1_GRP1_WWDT_STOP
  *         @arg @ref DDL_DBGMCU_APB1_GRP1_IWDT_STOP
  *         @arg @ref DDL_DBGMCU_APB1_GRP1_I2C1_STOP
  *         @arg @ref DDL_DBGMCU_APB1_GRP1_CAN1_STOP
  *         @arg @ref DDL_DBGMCU_APB1_GRP1_CAN2_STOP
  *
  *         (*) value not defined in all devices.
  * @retval None
  */
__STATIC_INLINE void DDL_DBGMCU_APB1_GRP1_UnFreezePeriph(uint32_t Periphs)
{
#if defined(APM32F403xx) || defined(APM32F402xx)
  CLEAR_BIT(DBGMCU->CFG, Periphs);
#else
  CLEAR_BIT(DBGMCU->APB1F, Periphs);
#endif /* APM32F403xx || APM32F402xx */
}

/**
  * @brief  Freeze APB2 peripherals
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref DDL_DBGMCU_APB2_GRP1_TMR1_STOP
  *         @arg @ref DDL_DBGMCU_APB2_GRP1_TMR8_STOP (*)
  *         @arg @ref DDL_DBGMCU_APB2_GRP1_TMR9_STOP (*)
  *         @arg @ref DDL_DBGMCU_APB2_GRP1_TMR10_STOP (*)
  *         @arg @ref DDL_DBGMCU_APB2_GRP1_TMR11_STOP (*)
  *
  *         (*) value not defined in all devices.
  * @retval None
  */
__STATIC_INLINE void DDL_DBGMCU_APB2_GRP1_FreezePeriph(uint32_t Periphs)
{
#if defined(APM32F403xx) || defined(APM32F402xx)
  SET_BIT(DBGMCU->CFG, Periphs);
#else
  SET_BIT(DBGMCU->APB2F, Periphs);
#endif /* APM32F403xx || APM32F402xx */
}

/**
  * @brief  Unfreeze APB2 peripherals
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref DDL_DBGMCU_APB2_GRP1_TMR1_STOP
  *         @arg @ref DDL_DBGMCU_APB2_GRP1_TMR8_STOP (*)
  *         @arg @ref DDL_DBGMCU_APB2_GRP1_TMR9_STOP (*)
  *         @arg @ref DDL_DBGMCU_APB2_GRP1_TMR10_STOP (*)
  *         @arg @ref DDL_DBGMCU_APB2_GRP1_TMR11_STOP (*)
  *
  *         (*) value not defined in all devices.
  * @retval None
  */
__STATIC_INLINE void DDL_DBGMCU_APB2_GRP1_UnFreezePeriph(uint32_t Periphs)
{
#if defined(APM32F403xx) || defined(APM32F402xx)
  CLEAR_BIT(DBGMCU->CFG, Periphs);
#else
  CLEAR_BIT(DBGMCU->APB2F, Periphs);
#endif /* APM32F403xx || APM32F402xx */
}
/**
  * @}
  */

/** @defgroup SYSTEM_DDL_EF_FLASH FLASH
  * @{
  */

/**
  * @brief  Set FLASH Latency
  * @param  Latency This parameter can be one of the following values:
  *         @arg @ref DDL_FLASH_LATENCY_0
  *         @arg @ref DDL_FLASH_LATENCY_1
  *         @arg @ref DDL_FLASH_LATENCY_2
  *         @arg @ref DDL_FLASH_LATENCY_3
  *         @arg @ref DDL_FLASH_LATENCY_4
  *         @arg @ref DDL_FLASH_LATENCY_5
  *         @arg @ref DDL_FLASH_LATENCY_6
  *         @arg @ref DDL_FLASH_LATENCY_7 - DDL_FLASH_LATENCY_127 (*)
  *
  * @retval None
  */
__STATIC_INLINE void DDL_FLASH_SetLatency(uint32_t Latency)
{
#if defined(FLASH_ACCTRL_WAITP)
  MODIFY_REG(FLASH->ACCTRL, FLASH_ACCTRL_WAITP, Latency);
#else
  MODIFY_REG(FLASH->CTRL1, FLASH_CTRL1_WS02 | FLASH_CTRL1_WS34, Latency);
#endif /* FLASH_ACCTRL_WAITP */
}

/**
  * @brief  Get FLASH Latency
  * @retval Returned value can be one of the following values:
  *         @arg @ref DDL_FLASH_LATENCY_0
  *         @arg @ref DDL_FLASH_LATENCY_1
  *         @arg @ref DDL_FLASH_LATENCY_2
  *         @arg @ref DDL_FLASH_LATENCY_3
  *         @arg @ref DDL_FLASH_LATENCY_4
  *         @arg @ref DDL_FLASH_LATENCY_5
  *         @arg @ref DDL_FLASH_LATENCY_6
  *         @arg @ref DDL_FLASH_LATENCY_7 - DDL_FLASH_LATENCY_127 (*)
  */
__STATIC_INLINE uint32_t DDL_FLASH_GetLatency(void)
{
#if defined(FLASH_ACCTRL_WAITP)
  return (uint32_t)(READ_BIT(FLASH->ACCTRL, FLASH_ACCTRL_WAITP));
#else
  uint32_t temp = READ_BIT(FLASH->CTRL1, FLASH_CTRL1_WS34);
  return (uint32_t)(READ_BIT(FLASH->CTRL1, FLASH_CTRL1_WS02) | temp);
#endif /* FLASH_ACCTRL_WAITP */
}

/**
  * @brief  Enable Prefetch
  * @retval None
  */
__STATIC_INLINE void DDL_FLASH_EnablePrefetch(void)
{
#if defined(FLASH_ACCTRL_PREFEN)
  SET_BIT(FLASH->ACCTRL, FLASH_ACCTRL_PREFEN);
#else
  SET_BIT(FLASH->CTRL1, FLASH_CTRL1_PBEN);
#endif /* FLASH_ACCTRL_PREFEN */
}

/**
  * @brief  Disable Prefetch
  * @retval None
  */
__STATIC_INLINE void DDL_FLASH_DisablePrefetch(void)
{
#if defined(FLASH_ACCTRL_PREFEN)
  CLEAR_BIT(FLASH->ACCTRL, FLASH_ACCTRL_PREFEN);
#else
  CLEAR_BIT(FLASH->CTRL1, FLASH_CTRL1_PBEN);
#endif /* FLASH_ACCTRL_PREFEN */
}

/**
  * @brief  Check if Prefetch buffer is enabled
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t DDL_FLASH_IsPrefetchEnabled(void)
{
#if defined(FLASH_ACCTRL_PREFEN)
  return (READ_BIT(FLASH->ACCTRL, FLASH_ACCTRL_PREFEN) == (FLASH_ACCTRL_PREFEN));
#else
  return (READ_BIT(FLASH->CTRL1, FLASH_CTRL1_PBEN) == (FLASH_CTRL1_PBEN));
#endif /* FLASH_ACCTRL_PREFEN */
}

#if defined(FLASH_CTRL1_HCAEN)
/**
  * @brief  Enable Flash Half Cycle Access
  * @retval None
  */
__STATIC_INLINE void DDL_FLASH_EnableHalfCycleAccess(void)
{
  SET_BIT(FLASH->CTRL1, FLASH_CTRL1_HCAEN);
}

/**
  * @brief  Disable Flash Half Cycle Access
  * @retval None
  */
__STATIC_INLINE void DDL_FLASH_DisableHalfCycleAccess(void)
{
  CLEAR_BIT(FLASH->CTRL1, FLASH_CTRL1_HCAEN);
}

/**
  * @brief  Check if Flash Half Cycle Access is enabled or not
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t DDL_FLASH_IsHalfCycleAccessEnabled(void)
{
  return (READ_BIT(FLASH->CTRL1, FLASH_CTRL1_HCAEN) == (FLASH_CTRL1_HCAEN));
}
#endif /* FLASH_CTRL1_HCAEN */

/**
  * @brief  Enable Instruction cache
  * @retval None
  */
__STATIC_INLINE void DDL_FLASH_EnableInstCache(void)
{
#if defined(FLASH_ACCTRL_ICACHEEN)
  SET_BIT(FLASH->ACCTRL, FLASH_ACCTRL_ICACHEEN);
#else
  SET_BIT(FLASH->CTRL1, FLASH_CTRL1_ICACHEEN);
#endif /* FLASH_ACCTRL_ICACHEEN */
}

/**
  * @brief  Disable Instruction cache
  * @retval None
  */
__STATIC_INLINE void DDL_FLASH_DisableInstCache(void)
{
#if defined(FLASH_ACCTRL_ICACHEEN)
  CLEAR_BIT(FLASH->ACCTRL, FLASH_ACCTRL_ICACHEEN);
#else
  CLEAR_BIT(FLASH->CTRL1, FLASH_CTRL1_ICACHEEN);
#endif /* FLASH_ACCTRL_ICACHEEN */
}

/**
  * @brief  Enable Data cache
  * @retval None
  */
__STATIC_INLINE void DDL_FLASH_EnableDataCache(void)
{
#if defined(FLASH_ACCTRL_DCACHEEN)
  SET_BIT(FLASH->ACCTRL, FLASH_ACCTRL_DCACHEEN);
#else
  SET_BIT(FLASH->CTRL1, FLASH_CTRL1_DCACHEEN);
#endif /* FLASH_ACCTRL_DCACHEEN */
}

/**
  * @brief  Disable Data cache
  * @retval None
  */
__STATIC_INLINE void DDL_FLASH_DisableDataCache(void)
{
#if defined(FLASH_ACCTRL_DCACHEEN)
  CLEAR_BIT(FLASH->ACCTRL, FLASH_ACCTRL_DCACHEEN);
#else
  CLEAR_BIT(FLASH->CTRL1, FLASH_CTRL1_DCACHEEN);
#endif /* FLASH_ACCTRL_DCACHEEN */
}

/**
  * @brief  Enable Instruction cache reset
  * @note  bit can be written only when the instruction cache is disabled
  * @retval None
  */
__STATIC_INLINE void DDL_FLASH_EnableInstCacheReset(void)
{
#if defined(FLASH_ACCTRL_ICACHERST)
  SET_BIT(FLASH->ACCTRL, FLASH_ACCTRL_ICACHERST);
#else
  SET_BIT(FLASH->CTRL1, FLASH_CTRL1_ICACHERST);
#endif /* FLASH_ACCTRL_ICACHERST */
}

/**
  * @brief  Disable Instruction cache reset
  * @retval None
  */
__STATIC_INLINE void DDL_FLASH_DisableInstCacheReset(void)
{
#if defined(FLASH_ACCTRL_ICACHERST)
  CLEAR_BIT(FLASH->ACCTRL, FLASH_ACCTRL_ICACHERST);
#else
  CLEAR_BIT(FLASH->CTRL1, FLASH_CTRL1_ICACHERST);
#endif /* FLASH_ACCTRL_ICACHERST */
}

/**
  * @brief  Enable Data cache reset
  * @note bit can be written only when the data cache is disabled
  * @retval None
  */
__STATIC_INLINE void DDL_FLASH_EnableDataCacheReset(void)
{
#if defined(FLASH_ACCTRL_DCACHERST)
  SET_BIT(FLASH->ACCTRL, FLASH_ACCTRL_DCACHERST);
#else
  SET_BIT(FLASH->CTRL1, FLASH_CTRL1_DCACHERST);
#endif /* FLASH_ACCTRL_DCACHERST */
}

/**
  * @brief  Disable Data cache reset
  * @retval None
  */
__STATIC_INLINE void DDL_FLASH_DisableDataCacheReset(void)
{
#if defined(FLASH_ACCTRL_DCACHERST)
  CLEAR_BIT(FLASH->ACCTRL, FLASH_ACCTRL_DCACHERST);
#else
  CLEAR_BIT(FLASH->CTRL1, FLASH_CTRL1_DCACHERST);
#endif /* FLASH_ACCTRL_DCACHERST */
}

#if defined(FLASH_CTRL1_PRFTB) || defined(FLASH_ACCTRL_PREF_TIMING)
/**
  * @brief  Enable Prefetch policy control
  * @retval None
  * @note   Prefetch buffer/cache line initiates the next prefetch after being accessed.
  */
__STATIC_INLINE void DDL_FLASH_EnablePrefetchPolicyCtrl(void)
{
#if defined(FLASH_CTRL1_PRFTB)
  SET_BIT(FLASH->CTRL1, FLASH_CTRL1_PRFTB);
#else
  SET_BIT(FLASH->ACCTRL, FLASH_ACCTRL_PREF_TIMING);
#endif /* FLASH_CTRL1_PRFTB */
}

/**
  * @brief  Disable Prefetch policy control
  * @retval None
  * @note   Prefetch buffer / the same cache line initiates the next prefetch only after being accessed twice.
  */
__STATIC_INLINE void DDL_FLASH_DisablePrefetchPolicyCtrl(void)
{
#if defined(FLASH_CTRL1_PRFTB)
  CLEAR_BIT(FLASH->CTRL1, FLASH_CTRL1_PRFTB);
#else
  CLEAR_BIT(FLASH->ACCTRL, FLASH_ACCTRL_PREF_TIMING);
#endif /* FLASH_CTRL1_PRFTB */
}

#endif /* FLASH_CTRL1_PRFTB || FLASH_ACCTRL_PREF_TIMING */

#if defined(FLASH_ACCTRL_RD_INT_EN)
/**
  * @brief  Enable Flash read interrupt
  * @retval None
  */
__STATIC_INLINE void DDL_FLASH_EnableReadInt(void)
{
  SET_BIT(FLASH->ACCTRL, FLASH_ACCTRL_RD_INT_EN);
}

/**
  * @brief  Disable Flash read interrupt
  * @retval None
  */
__STATIC_INLINE void DDL_FLASH_DisableReadInt(void)
{
  CLEAR_BIT(FLASH->ACCTRL, FLASH_ACCTRL_RD_INT_EN);
}
#endif /* FLASH_ACCTRL_RD_INT_EN */

#if defined(FLASH_ACCTRL_RD_INT_TIMING)
/**
  * @brief  Set Flash read interrupt timing
  * @param  Timing This parameter can be one of the following values:
  *         @arg @ref DDL_FLASH_TRC_FAST
  *         @arg @ref DDL_FLASH_TRC_SLOW
  * @retval None
  */
__STATIC_INLINE void DDL_FLASH_SetReadIntTiming(uint32_t Timing)
{
  MODIFY_REG(FLASH->ACCTRL, FLASH_ACCTRL_RD_INT_TIMING, Timing);
}
#endif /* FLASH_ACCTRL_RD_INT_TIMING */

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

#endif /* defined (FLASH) || defined (SYSCFG) || defined (DBGMCU) */

/**
  * @}
  */

#ifdef __cplusplus
}
#endif

#endif /* APM32F4xx_DDL_SYSTEM_H */


